app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "last_login_at", "permalink", "updated_at", "activated_at", "crypted_password", "visits_count", "remember_token_expires_at", "admin", "activation_code", "filter", "remember_token", "time_zone", "login", "email", "created_at") VALUES('3758944c53c87a6ac6cfb2388978eaa5bc2a4dfc', NULL, NULL, '2008-12-14 23:53:10', NULL, 'a4f9eb4df7e5467ed7c0adbc4821eb4968b2f5fa', 0, NULL, 'f', NULL, NULL, NULL, 'Hawaii', '123456', '123456', '2008-12-14 23:53:10')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save